GlblVarList = [
    [
        u'Расчетное давление, МПа',
        u'Номинальный внутренний диаметр обечайки, мм',
        u'Номинальное допускаемое напряжение, МПа',
        u'Отрицательный допуск на толщину стенки по КД, мм',
        u'Технологическая прибавка к толщине стенки, мм',
        u'Утонение стенки за счет коррозии под воздействием рабочей среды, мм',
        u'Утонение стенки за счет коррозии при дезактивации, мм'
    ],
    [
        u'Расчетное давление, МПа',
        u'Номинальный максимальный диаметр обечайки, мм',
        u'Номинальный минимальный диаметр обечайки, мм',
        u'Угол конуса, градусы',
        u'Номинальное допускаемое напряжение, МПа',
        u'Отрицательный допуск на толщину стенки по КД, мм',
        u'Технологическая прибавка к толщине стенки, мм',
        u'Утонение стенки за счет коррозии под воздействием рабочей среды, мм',
        u'Утонение стенки за счет коррозии при дезактивации, мм'
    ],
    [
        u'Расчетное давление, МПа',
        u'Номинальный внутренний диаметр днища, мм',
        u'Высота выпуклой части днища до внутренней поверхности, мм',
        u'Номинальное допускаемое напряжение, МПа',
        u'Отрицательный допуск на толщину стенки по КД, мм',
        u'Технологическая прибавка к толщине стенки, мм',
        u'Утонение стенки за счет коррозии под воздействием рабочей среды, мм',
        u'Утонение стенки за счет коррозии при дезактивации, мм'
    ],
    [
        u'Расчетное давление, МПа',
        u'Номинальный внутренний диаметр днища (соответствует высоте выпуклой части днища), мм',
        u'Номинальное допускаемое напряжение, МПа',
        u'Отрицательный допуск на толщину стенки по КД, мм',
        u'Технологическая прибавка к толщине стенки, мм',
        u'Утонение стенки за счет коррозии под воздействием рабочей среды, мм',
        u'Утонение стенки за счет коррозии при дезактивации, мм'
    ],
    [
        u'Расчетное давление, МПа',
        u'Номинальный наружный диаметр трубопровода, мм',
        u'Номинальное допускаемое напряжение, МПа',
        u'Рассчетный коэффициент снижения прочности',
        u'Суммарная прибавка к толщине стенкиб мм',
    ],
    [
        u'Расчетное давление, МПа',
        u'Номинальный наружный диаметр трубопровода, мм',
        u'Номинальное допускаемое напряжение, МПа',
        u'Рассчетный коэффициент снижения прочности',
        u'Суммарная прибавка к толщине стенкиб мм',
    ]
]

pics = ['\\pics\\pic421_1.PNG',
        '\\pics\\pic421_2.PNG',
        '\\pics\\pic421_3.PNG',
        '\\pics\\pic421_4.PNG',
        '\\pics\\pic421_4.PNG',
        '\\pics\\pic421_4.PNG']
