# =============================== Словарь со списками имен переменных и наименований полей ввода ====================
# GlblVarList = [
#     [
#         [7],
#         ['p', 'd', 'sigma', 'c11', 'c12', 'c21', 'c22'],
#         [u'Расчетное давление, МПа',
#          u'Номинальный внутренний диаметр обечайки, мм',
#          u'Номинальное допускаемое напряжение, МПа',
#          u'Отрицательный допуск на толщину стенки по КД, мм',
#          u'Технологическая прибавка к толщине стенки, мм',
#          u'Утонение стенки за счет коррозии под воздействием рабочей среды, мм',
#          u'Утонение стенки за счет коррозии при дезактивации, мм']
#     ],
#     [
#         [9],
#         ['p', 'd', 'd0', 'alpha', 'sigma', 'c11', 'c12', 'c21', 'c22'],
#         [u'Расчетное давление, МПа',
#          u'Номинальный максимальный диаметр обечайки, мм',
#          u'Номинальный минимальный диаметр обечайки, мм',
#          u'Угол конуса, градусы',
#          u'Номинальное допускаемое напряжение, МПа',
#          u'Отрицательный допуск на толщину стенки по КД, мм',
#          u'Технологическая прибавка к толщине стенки, мм',
#          u'Утонение стенки за счет коррозии под воздействием рабочей среды, мм',
#          u'Утонение стенки за счет коррозии при дезактивации, мм']
#     ],
#     [
#         [8],
#         ['p', 'd', 'h', 'sigma', 'c11', 'c12', 'c21', 'c22'],
#         [u'Расчетное давление, МПа',
#          u'Номинальный внутренний диаметр днища, мм',
#          u'Высота выпуклой части днища до внутренней поверхности, мм',
#          u'Номинальное допускаемое напряжение, МПа',
#          u'Отрицательный допуск на толщину стенки по КД, мм',
#          u'Технологическая прибавка к толщине стенки, мм',
#          u'Утонение стенки за счет коррозии под воздействием рабочей среды, мм',
#          u'Утонение стенки за счет коррозии при дезактивации, мм']
#     ],
#     [
#         [7],
#         ['p', 'd', 'sigma', 'c11', 'c12', 'c21', 'c22'],
#         [u'Расчетное давление, МПа',
#          u'Номинальный внутренний диаметр днища (соответствует высоте выпуклой части днища), мм',
#          u'Номинальное допускаемое напряжение, МПа',
#          u'Отрицательный допуск на толщину стенки по КД, мм',
#          u'Технологическая прибавка к толщине стенки, мм',
#          u'Утонение стенки за счет коррозии под воздействием рабочей среды, мм',
#          u'Утонение стенки за счет коррозии при дезактивации, мм']
#     ],
#     [
#         [7],
#         ['p', 'd', 'sigma', 'c11', 'c12', 'c21', 'c22'],
#         [u'Расчетное давление, МПа',
#          u'Номинальный наружный диаметр трубопровода, мм',
#          u'Номинальное допускаемое напряжение, МПа',
#          u'Отрицательный допуск на толщину стенки по КД, мм',
#          u'Технологическая прибавка к толщине стенки, мм',
#          u'Утонение стенки за счет коррозии под воздействием рабочей среды, мм',
#          u'Утонение стенки за счет коррозии при дезактивации, мм']
#     ]
# ]


GlblVarList = [
    [
        u'Расчетное давление, МПа',
         u'Номинальный внутренний диаметр обечайки, мм',
         u'Номинальное допускаемое напряжение, МПа',
         u'Отрицательный допуск на толщину стенки по КД, мм',
         u'Технологическая прибавка к толщине стенки, мм',
         u'Утонение стенки за счет коррозии под воздействием рабочей среды, мм',
         u'Утонение стенки за счет коррозии при дезактивации, мм'
    ],
    [
        u'Расчетное давление, МПа',
         u'Номинальный максимальный диаметр обечайки, мм',
         u'Номинальный минимальный диаметр обечайки, мм',
         u'Угол конуса, градусы',
         u'Номинальное допускаемое напряжение, МПа',
         u'Отрицательный допуск на толщину стенки по КД, мм',
         u'Технологическая прибавка к толщине стенки, мм',
         u'Утонение стенки за счет коррозии под воздействием рабочей среды, мм',
         u'Утонение стенки за счет коррозии при дезактивации, мм'
    ],
    [
        u'Расчетное давление, МПа',
         u'Номинальный внутренний диаметр днища, мм',
         u'Высота выпуклой части днища до внутренней поверхности, мм',
         u'Номинальное допускаемое напряжение, МПа',
         u'Отрицательный допуск на толщину стенки по КД, мм',
         u'Технологическая прибавка к толщине стенки, мм',
         u'Утонение стенки за счет коррозии под воздействием рабочей среды, мм',
         u'Утонение стенки за счет коррозии при дезактивации, мм'
    ],
    [
        u'Расчетное давление, МПа',
         u'Номинальный внутренний диаметр днища (соответствует высоте выпуклой части днища), мм',
         u'Номинальное допускаемое напряжение, МПа',
         u'Отрицательный допуск на толщину стенки по КД, мм',
         u'Технологическая прибавка к толщине стенки, мм',
         u'Утонение стенки за счет коррозии под воздействием рабочей среды, мм',
         u'Утонение стенки за счет коррозии при дезактивации, мм'
    ],
    [
        u'Расчетное давление, МПа',
         u'Номинальный наружный диаметр трубопровода, мм',
         u'Номинальное допускаемое напряжение, МПа',
         u'Отрицательный допуск на толщину стенки по КД, мм',
         u'Технологическая прибавка к толщине стенки, мм',
         u'Утонение стенки за счет коррозии под воздействием рабочей среды, мм',
         u'Утонение стенки за счет коррозии при дезактивации, мм'
    ]
]